{"pageProps":{"post":{"date":"2023-05-09","title":"Hello World","slug":"hello-world","description":"My first blog post in which I ramble about typewriters for a time.","scans":["01.jpg"],"model":"Olivetti Studio 44","supplements":null,"contents":[{"imgSrc":"01.jpg","text":"I know what you're thinking... Oh great, another software\nengineers technology blog. We definitely do not have\n\nenough of THOSE. Buti hear me out on this one.\n\nThis technology blog uses typewriters.\n\nEh? Eh? Whaddya think?\n\nOk, #0 it'e a bit of a gimmick, but I legitimately like\ntyping on a typewriter more than my computer. I wouldn't\nwrite CODE on the damn thing, mind you, but I find it\nrather pleasing to write narrative or journalistic content\non. And that is precisely what I intend to use this blog for.\nEvery other time I've tried to start a blog, I've had\n\nsome agenda. I've created it as a means to promote my\nprofessional career. I get about a dozen posts deep and\nrealize that I don't actually care that much about tech\n\nto write a full on tech blog. I'm not saying the same thing\nwon't happen to this blog, but I am saying thst I want to\nget back to the joy of creating a whatever website just for\nthe sake of it. I got into this industry by throwing up\npages full of animuted GIFs on Geocities as a pre-teem.\n\nOne of my most accomplished creations as a kid was a hand\nmodelling website on which I posted a collection of\n\nphotos of my hands holding or touching various objects.\n\nIt was completely stupid and pointless. I loved it.\n\nI admit I was hoping to get a hand modelling gig, but I\ndidn't REALLY think that would happen. Although if some\ninternet archiver has my old hand modelling website quietly\nconsuning disk space on some aging hard crives, I'd love\n\nto have that back :)\n\nAll this to say that this blog is for me. It's like my own\nTwitter feed. A social network of one. I'll definitely talk\nabout technology here. But I'll also talk about food,\n\nthe environment, creativity, and the never ending pursuit\nof happiness. I hope you like it. If you don't... well,\nthere are plenty of other technology blogs.\n"}]}},"__N_SSG":true}