{"pageProps":{"post":{"date":"2023-05-17","title":"Why Typewriters, Tho!?","slug":"why-typewriters","description":"A brief introduction to my typewriter obsession and thoughts on why every household deserves to have one.","scans":["why-1.jpg","why-2.jpg"],"model":"Olivetti Lettera 32","supplements":["PXL_20230517_140755736.jpg","PXL_20230517_141053681.jpg"],"contents":[{"imgSrc":"why-1.jpg","text":"My generation are often referred to as \"digital natives\" because we\nsupposedly gre up with a cellular phone in one hand and a GameBoy im\n\nthe other. But I distinctly remember the day we got the internet\n\nin our household; screeching in our perpetually congested hard wired\ntelephone line. Prior to that, I actually sometimes did homework on\n\na real, physical typewriter. Yes, I've spent a fair amount of my\ndeveloping years around computers, but I wasn't born to them. I was\nthere when my school carted in a few dozen beige boxes with glowing,\nbright green monitors and a promise of an equally glowing educational\nrevolution. In truth most of my classmates just spent computer lab time\nplaying Oregon Trail, My favorite thing to do with lab time was wrsghk\nwrite short stories and print them out on the behemoth of a dot matrix\nprinter to take home.\n\nBack then, I didn't have much of a filter. It was easy to pour out\n\nideas about how jimmy dean sausages were made (hint: it's people)\nwithout questioning my terrible spelling or sentence structure. As\n\nI've grown older and more accustom to the conveniences of modern word\nproceswors, my writing has become far sparser and less loose. When you can\nquickly erase everything you write, it becomes all too eawy %o leave\n\na writing session with a blank page or a couple of ellipsis, It got\n\nto the point where I ceased writing all together.\n\nGoing through my old high school writing prompts, I remembered how\n\nmuch I used to enjoy writing. The thought of grappling with a piece\n\nof judgemental software once again prevented me from taking the thought\nany further. Until I remembered my childhood typewriter. As with so many\nlegacy items replaced by software solutions, it was long gone. ® So I\nset about collecting a set of manual typewriters from antique and thrift\nshops. What started as a moderate curiosity quickly became an obsession\nIn a matter of months I went from one typewriter to six.\n\nWhat is it that makes a typewriter so alluring? Is it the wisceral\nthwack of the keys? The wobbly charm of the ink-blotted text?\n"},{"imgSrc":"why-2.jpg","text":"It's all of these things, and the intentionality inherent in the\ndevice. They are physically demanding machines, so you must think\n\nabout what you want to say or waste precious finger strength. You\n\ncan't do anything with a typewriter BUT type, so you can't get\ndistracted by the social medias or IMDB. Type written material stands\napart from its digital counterpart because it carries with it a sense\nof importance., Just imagine the sensatiom and emotion you would have\nreading a type-written letter versus the same message delivered as an\ne-mail. All T can say is that I've never been excited to open an\nelectronic message.\n\nSince acquiring my typewritérs, I've worked to establish slow communication\nwith friends and family. I'd rather recieve a letter once every tew months\nthan maintain the illusion of friendship through social media. The\nproblem with social meéia is that it tricks you into thinking you are\ncontinuing your relationships with people because you always know what\nis going on with them. I don't need to talk to so-and-so because I\n\"liked\" the post about their new baby... But this is a topic for another\nday, and one I'll surely revisit many times.\n\nThe typewriter is a mechanical wonder that will dlmost certainly never\nbe manufactured ever again. The dwindling number of them left on the\nplanet are all that will ever be. We are fortunate, then, that the\nthings are so resillient. My typewriter collection will likely outlive\nme, and I hope that they service generations to come. I love to think\nabout the history of these machines. Who owned this before me? Were\nthey also weird story tellers, obsessed with writing fantastical origin\nstories for tube meats?\n\nA1l I know is that the typewriter deserves a prominent place in my\nhousehold and lifestyle. It has re-ignited my love ot writing, and\ngiven me a delightful method of staying in touch with friends and\nfamily. If you have any curiosity about them, head this advice:\n\nget one before they are gone forever.\n"}]}},"__N_SSG":true}