{"pageProps":{"post":{"date":"2023-09-11","title":"Outside Work","slug":"outside-work","description":"Finding meaning anywhere but the workplace.","scans":["you-are-not-your-career-1.jpg","you-are-not-your-career-2.jpg","you-are-not-your-career-3.jpg"],"model":"Smith Corona Silent","supplements":null,"contents":[{"imgSrc":"you-are-not-your-career-1.jpg","text":"As an sdult you get to be an exrert ot one thing. If you ere lucky (or a\nworkaholic) this is also your fevorite thing to do. I got into computers\nbecause my choices of extracurricular sctivities in rursl Uteh were limite d\nand often skewed towerd highly gendered teem sports. My perents mede me\nendure sessons of bssebsll and bssketbsll before accepting thet I wes\nnever going to be very asthletic.. I wes more st home with the bend kids. Tk\nThough I bleme my school's insistence on beginning music education with\nthe recorder for killing eny desire to esctuslly sign up. I wanted to plasy\nthe pieno.. Probebly in pert becsuse sll of my elder siblings could play, b\nbut mostly because the instrumment is e fascinating, intricate, solo-act\nmechine.. I wes so taken by it thet I invented my own musicsl notstion in\norder to remember the first song I learned. The cluster of squeres end\narrows I ceme up with doesn't have sany musical meening to me todey, but I\nloved thet doodle so much thet I lster hed it tettooed on myself,\n\nYou see... My enfatustion with the pisno wened shortly after I wes put in\nlessons.. I heted it becsuse I wes REQUIRED to do it. The moment I wes\nallowed to quit lessons I did so with gusto..\n\nI've since spent yesrs trying to lesrn sgain es en edult. The tettoo is\n\na reminder of the megic =nd wonder thet music meking inspires in me.\n\nIt's a reminder to stick with it even when practicing feels like &\n\nfutile sloge\n\nI ssid before thet as an adult you get to be good ot one thing, but what\nI meent to sey is you HAVE to be good =t one thing, From there it is easy\nto stumble into a lazy river of endless stresming enterteinment. Never\ndoing much more with your life than fulfilling your role as a well-\nmannered consumers.\n"},{"imgSrc":"you-are-not-your-career-2.jpg","text":"We give our most fruitful yesrs and hours of the day to compsnies thet pay\nus the least amount of money they cen get swey with end would drop us in\nfevor of artificisl intelligence the moment it becomes visble. We're left\ntoo mentally snd emotionally drasined at the end of sn 8 hour day to do much\nmore than survive, faxzddximsuikxkaximiuym\n\nTo add insult to injury, we get two messley deys s week to recover end\nsqueeze in all of the chores we were un=ble to do throughout the week,\nSomehow we sre supposed to show up on monday feeling refreshed and\nsatisfied with our life's tregectory.\n\nHow do we take our lives back? How sre we to derive joy end meaning from\nthis endless churn of work, consumption, snd chores?\n\nThe first step is accepting thet you are not your cereer., What you do for\nyour 9 to 5 is the lesst interesting thing you will do all dey. It\ndoesn't metter if you sre reslly good =t it (of course you =re) or if it\nis reslly importent (but is it?) nobody sctually wents to know ebout your ‘\njob,. Humens ere just terrible st meking smaell telke\n\nWhat gets you out of bed in the morning? What do you do when the exchange\nof money is not involved? These ere the things you get to be okay et..\nWhen do.you meke time for them?\n\nFor me it is unreslistic to exvect myself to be sherp enough to practice\nthe pisno or drew after e dsy of work,.So I've teken to waking up esrly\nenough to heve s few hours of personsl time before my work dsy sterts,\n\nIf you work from hoﬁe it ie crucisl thet you not stert work until your\nsgreed upon time. Lest you fell into the trep of simnly working more.\n"},{"imgSrc":"you-are-not-your-career-3.jpg","text":"T used to best myself up sbout feeling lethergic in the evenings, but this\nshift towsrd using my most oroductive rmorning hours for myself has chenged\neverything.. It's okasy to be exheusted =fter work., It's oksy to went nothing\nmore then to meke dinner snd pley video gemes until bed time.\nWhet metters is thet you meke time for developing those \"other\" skillse\nThose things nobody will pay you to do but sre so essentisl for\nnourishing your soul.\nYou may be so intellectuslly sterved thet you don't even know whet those\nthings ere, Or maybe you heve snxiety sbout your ability to perform thems\nTake the time anyweye.\nI won't sey thet I'm haopiest when I'm cresting something, but I will sey\nI em most unhevpy when I am note The crestive process cen feel blesk snd\nharsh much of the time, but it allows us to eek out meaning in this\nbeautiful mess we call consciousness,. I'm never going to be s perticulsrly\nsmezing pienist, but I sbeolutely love sitting down to nley a brilliently\ncomnlex piece from mewory. Drawing the music out from deer within ny\nskeletsl memory. For s moment I get to peer inside the mind of e greest\ncomposer as I retell their musical story. Who knovws... Meybe one dey\nI'11 even leave behind my own storiese\n"}]}},"__N_SSG":true}