{"pageProps":{"post":{"date":"2023-08-18","title":"Less Phone is More Smart","slug":"less-phone-more-smart","description":"Your smart phone is making you unhappy. Use it less.","scans":["less-phone-more-smart-1.jpg","less-phone-more-smart-2.jpg","less-phone-more-smart-3.jpg","less-phone-more-smart-4.jpg"],"model":"Olympia SM9","contents":[{"imgSrc":"less-phone-more-smart-1.jpg","text":"It is no secret that your phone is making you unhappy. At least\nI have yet to read a study that marries increased screen time\nwith increased happiness, Yet plop oneself down in any public\nspace and you will innevitably witness a deluge of glass-eyed\nphone: scrollers, Hell, one of them might even be you!\n\nHow did we get to a place where a couple goes out to dinner——\npresumably to spend more time with each other--only to surf\n\ntik tok independently. In perhaps the most hilarious and tragic\nexample of distracted phone usage, I once watched a man try to\nInstagram the concert he was attending, forget who it was and\ncheck the ticket stub in Gmail, scroll around on Wikipedia for\na timer to learn more about the artist, then field a bunch of\ntext messages about golf. All to the background of a song that\nwas not so subtly about the toxicity of cell phone indulgence.\nI am not immune to it either. I still sometimes catch myself\nfuriously refreshing my favorite news feeds as if there is some\nachievement one unlocks by seeing a new article first.\n\nFirst.\n\nOr worse: I find myself staring at a digital shopping cart full\nto the brim with items of varying usefullnesse\n\nAs an extreme introvert, my #@¢ smartphone was something of\n\na godsend in my bachelor days. It meant I could go somewhere\nalone and appear as though somebody cared about me. Of course\nwe all knew I was tapping refresh on Facebook and not, in\n\nfact, answering an onslaught of messages from my entourage.\nFurthermore, I was deluded to think that gluing my eyes to a\nscreen made me look and feel anything other than more lonely.\n\nI eventually learned to get over my fear of public displays of\nsingularity and instead travelled with a book as my prop and\ncompanion. I try to make a concerted effort not to pull out my\nphone when I have down time. It is often tempting to\nsneak a peak here and there.\n"},{"imgSrc":"less-phone-more-smart-2.jpg","text":"But there is almost invariably nothing there for me, Therein\nlies the whole issue with smart phones. They were not designed\nfor us. Once you accept that their utility is a byproduct of the\ndata collecting ad revenue machine they are meant to be, you\n\ncan start to have a healthy relationship with it.\n\nI wish that this is now the moment that I could recommend a\nprivacy respecting Linux phone designed by a cammunity around\nindividual health and happiness, but that sadly doesn't quite\nexist yet. At least not if you are unwilling to make significant\ncompromises, I've tried multiple times to de-google my life\n\nonly to repeatedly come to the same conclusion: sometimes\n\nGoogle © « does have the best tools (or Apple, Microsoft, Sams-\nung, and so on)\n\nWhile there is definite merit in the pursuit of a fully free\n\nand open source toolkit, I'm not advocating that you toss your\nproprietary wares in the trash. Rather, learn how to use them\nless, Make them work for you instead of leech off of you.\n\nThe smart phone was billed as the swiss army knife of technology.\nYou no longer needed a GPS, walkman, gameboy, or day planner if\nyou simply signed the terms of agreement and willingly handed\nover your life to a single slab of glowing, touch sensitive glass.\nIt is true that the smartphone gave us those things, but\n\nat what sacrifices?\n\nThis is why, perhaps counterintuitively, many of my suggestions\nwill involve acquiring more technology. Think about what\nessential features your phone provides and ask yourself if a\npurpose built device could provide a better, distraction free\nexperience,\n"},{"imgSrc":"less-phone-more-smart-3.jpg","text":"My gateway into this line of thinking was the smartwatch.\nI often need to 2 factor authenticate applications for work\nwhich typically involves unlocking and engaging with my phone\nfor a brief moment. Once eyes are trained on the screen,\nall bets are off. What starts as a simple login ends halfway\ndown a NY Times article, A smartwatch gives you freedom from\nthe smartphone rabbit hole by letting you engage with notificat-\nions without access to the whole suite of attention stealing apps.\nThe key to making this work is to be ruthless about which notif-\nications you allow through. Uninstall anything that you do not\nregularly use. Mute notifications on the apps you want to keep\nbut don't want to hear from. If you aren't ready to kill your\nsocial media accounts, at least mute them. I've even gone as far\nas creating a new phone number and email address that is only\never shared with REAL people that I care about and would want to\nrespond to immediately. This: way I can turn off notifications fom\nthe junk and let bots quietly churn in silence, If you've already\nburned your current number by sticking it in one too many sketchy\nweb forms, just port it over to google voice and start fresh\n\nwith your carrier.\nIdeally your watch should only notify you about things you\nreally care about. No time wasters allowed! Once you have\nachieved notification bliss, I urge you to experiment with\nleaving your phone on your nightstand (or wherever it rests)\nany time you are home. If my own experience is any indication,\nyou won't always succeed in this experiment. So ask yourself...\nWhat is it you regularly need your phone for? Can you get this\nsome other way? For me it was music, so I bought myself a\nwalkman, Yes they still exist, Do you play games on your phone?\nTry a dedicated gaming handheld. Read the news? Get a\nmagazine subscription...\n"},{"imgSrc":"less-phone-more-smart-4.jpg","text":"You may not immediately feel happier with less screen time.\nYou might even feel BORED,\n\nSit with that feeling.\n\nRevel in ite.\n\nWhat does your mind do?\n\nWhat do you notice?\n\nWhat will you do now that you've reclaimee time for yourself\nfrom your device?\n"}]}},"__N_SSG":true}