{"pageProps":{"post":{"date":"2024-02-26","title":"Interspecies Friendship","slug":"pets","description":"My history with pets and how we shape each other.","scans":["pets-1.jpg","pets-2.jpg","pets-3.jpg"],"model":"Brother Charger 11","supplements":null,"contents":[{"imgSrc":"pets-1.jpg","text":"Cne of the more disturbing recurring nightmares I have experienced\nas an adult involves a hamster which I have forgottem that I\nadopted and have proceeded to neglect until it died of starvation\nor maybe severe rodent depression. The reason this dream haunts\n\nme so much is because I8m not sure if it is actually a memory.\n\nThe fact is that I did have a pet hamster as a kid that I didn't 1l\nlike very much. It wasn't unfriendly, but it sort of just did\n\nits own thing most of the time. Which is to say that it left a\ntiny trail of shit and piss all over the couch that I had to\n\nclean up =xmA®Y any time I let it out. To this day I honestly cannot\nremember if the sight of its still, pee stained body flopped over\nan empty food bowl with its tongue swollen and lolling out the\nside of its face is a fantasy I dreamed up or if it actually\nhappened. I'll never know for sure if I neglected that rodent to\ndeath, and that will forever haunt me.\n\nThe hamster was the first pet that was completely my responsibility\nbut my family had a long line of rats leading up to ite Rats are\nsurprisingly lovely pets. My favorite rat-based past times involved\ntucking a rat into my shirt so that it could scurry around my\n\nmid section. I also enjoyed building elaborate mazes out of\n\nVHS tapes which were often short cut or completely circumvented\nby the wily beasts. They were incredible escape artists. Even with\na stack of books on top of their cage, it was likely you'd find\none in your bed some nights.\n\nMy father had a beautiful siamese cat named Thumper who's origin\npredated myself and thus was never information I cared enough\n\nto acquire. I say that Thumper belonged yo my dad because he\nabsolutely loathed the rest of us and was prone to long bouts of\nhide and seek inside my parent's box springs. I desperately wanted\nThumper to like me because he was handsome and I liked the way he\nhung like a limp rag doll in your hands when you picked him up.\n"},{"imgSrc":"pets-2.jpg","text":"When my mother brought home a mangled stray kitten, I was elated\nby the opportunity to make a feline friend. We named him Boo Boo\non account of the limb we had to surgically remove, I adored\n\nBoo Boo, and Boo Boo tolerated me in return. This is surprising im\nhindsight considering my aggressive, childlike animal affection, an.\nmy undiagnosed OCD which found me frequently pinning down the cat\nto pick at any scabs he had collected from neighborhood brawls.\nLater in life, Boo Boo would develop a habit of clawing at me throu-\ngh the banister any time I descended into our basement. A behavior\nI found baffling at hte time but have now accepted as much\ndeserved, plotted assassination attempts.\n\nBoo Boo wasn't the only stray we took im. My brother came across\n\na gorgeous but entirely indistinguishable heniz 57 of a mutt\n\nthat we ended up keeping. Her name was Kasha and she was quite\n\nthe force to be reconned with., The terms for keeping her arcund\ninvolved us kids taking her on walks.e. 1 was entirely too young\nand innocent to enter such a treaty, and so submit that it was\nunfair for me to participate in this rotation. My siblings with\ntheir advanced age and muscular development may remember this\n\nact differently, but I didn't really take Kash on walks. Kasha\ntook me on walks.\n\nKasha wasn't a fully integrated member of the family in the same\nway the cats were. She was relegated to living outside; something\nItve since realized was a form of neglect if not abuse. We cared\nfor Kasha and made her as comfortable as one can make an outside\ndog, but I'm not sure any of us saw her a s anything other than\n\na chore. This was partially why I decided to adcpt a dog of my own\nin my late twenties. I needed a dog-rearing redemption. I had\nalso never been in a serious relationship and was beginning to\ngrow concerned about my looming narcicism. I needed something\nother than myself to focus my atéention on.\n"},{"imgSrc":"pets-3.jpg","text":"I settled on adopting & retired racing greyheund because I wanted\na large dog but still lived in a studio apartment. During my home\nvisit the interviewer's greyhound was nervously farting a potent\ncloud about my living space. Embarrassed, the interviewer finally\nsaid \"I'm really sorry about my dog. I forgot to bring her bed.\"\nA remark I didn't fully appreciate until I had adopted my own\ndelicate princess.\n\nMy dog Bree came in to my life at nearly the same time my wife\ndid. In fact you could say it was Bree that brought us together.\nWe met online, but it was her recently adopted greynound bugsy\nthat gave us a connecting point. We obvicusly got on quite well\non account of us being married now, but the dogs took longer\n\nto warm up to each other. Bugsy was a simple boy that wanted\n\nto be friends with everyone. He adored Bree and followed her\nevery lead. Even when that lead was misdirection to distract\n\nhim from the more desireable bed. Bree was much smarter than\nBugsy and mostly saw him as competition for soft sleeping surfaces.\nAs a rescue that had been in the system for the first six years of\nher life, Bree took some time to open up. She was notoricusly\nbad at playing with other dogs; usually barking loudly in their\nfaces or hoarding the toy that every other dog wanted to play\nwith. Her favorite game to play was 'this is mine now and I'm\ntaking it to my bed\" By the end of her life, Brece had completely\ntransformed. I've never felt more proud than the moment my\nsenior lady instigated play time with my in-law's bichon.\n\nBree wasn't the only one changed by the relationship. I came out\nthe other side a much more patient and understanding caretaker.\n\nI regret the moments I was upset with her and tried to make her\nwhat T wanted rather than understand who she was. She taught me\nwhat an integral part of the family a petcan and should be.\nOutside of my wife, Bree was my best friend. Not my accessory.\nThat does make me retroactively guilty for my childhood pets\n\nbut also sheds a joyful light on the animal relationships to\ncome.\n"}]}},"__N_SSG":true}