{"pageProps":{"post":{"date":"2023-06-06","title":"Dress Up","slug":"dress-up","description":"How I learned to stop caring about trends and dress myself.","scans":["dress-up-1.jpg","dress-up-2.jpg"],"model":"Olivetti Lettera 32","supplements":null,"contents":[{"imgSrc":"dress-up-1.jpg","text":"The last time I could have been considered fashionable was probably back\nwhen my mother still dressed me. Of course any compliment ol my appearance\nthen would have been foilowed by a pinch on the cheek. I had an extended\nawkward phase that transcended even the absurdity of 90's fashion. I loved\npoiyester pants, tucked in polos, and enormous skate shoes. Pretty much\neverything I wore was one to two sizes too big for me. This was a cost\nsaving measure on my mom's part due to the alarming rate at which my body\nwas elongating., I of course knew this strategy weil, but it still took years\nto accept that I had in fact stopped growing. I'd just been wearing loose\nunderwear, baggy shirts, and clown shoes for most of my aduit life.\n\nAs probably most kids are, I was extremely self conscious of my body. ‘his\nwas undoubtedly made worse by my mormon upbringing that strongly emphasizes\nmodesty. As a result I almost never wore shorts. An amusing historical\n\npoint when you consider that my modern uniform includes the shortest hemp\nshorts I can find. Gathering up the courage to wear shorts was no small feat,\nAny time I was spotted bare-legged, someone would inevitably remark on\n\nmy sizable calts and deciare that I must be a runner. Imagine their\ndisappointment when I told them it was jJust because I had a habit of\nwalking on my toes, The heat of los angeles finally pushed me over the edge,\nand I slfpped into a pair of snorts that would Iorever change my dress habits,.\nI quickly realized everything I knew about dressing mysell was wronge. For\ntoo long 1 had tried not to draw attention to myself; wearing generic,\n\nloose fitting t-shirts anda pants. 1 started turning over my wardrobe\n\nwith short shorts, colorful socks, and colorful shirts., all the while\nselecting a size or two down from what I thought was correct. Not only was\nthis more comtortable, but I feit more contident, too. I started to teel\nproud of my shapely legs and lanky body. The more comfortable I felt in my\nclothes. the more comfortable I felt in my body. I stopped caring what\n\nother people thought about how I iooked and started outfitting myself in\nincreasingly wilder, more colorful clothing,.\n\nI knew I hzd overcome my concern for other people's opinions when I bought\nmyself a straw fedora. I always wanted a fancy hat, but was mortified by\n\nthe potential for ridicule from my surrounding ball-cap wearing peers.\n"},{"imgSrc":"dress-up-2.jpg","text":"I had this crippling, irrational tear that donning such a hat would\n\nattract unscolicited verbali abuse., “Hat person, hat person. Look at\n\nthat hat person wearing a hat.\" they'd jeer.\n\nThis of course aid not happen. In fact, to my surprise people actually\nstarted to compliment my appearance. Who kmew that wearing what you love\ncould be a fashion statement. I've never been one to care about trends, ana\nif the millenial and zoomer attire is any indication, the new trend is no\ntrend. 1 hope that this along with the rise of thrifting spells doom\n\nfor the fast rashion industrye.\n\n1 grow increasingly weary of the capitalist churmj replacing poorly\nmanufactured clothing once a year. 1've adopted the \"buy it once\" mentality\nand specifically seek out ethical, sustainable brands the work with\nnatural materials. No more polyester pants. 1 see my wararobe as an\ninvestment in my confidence. It feels good to look nice. It feels good\n\nto wear what I want to wear and not what I think someone else would\n\nlike me to wear.\n\nIf I could give one piece of advice to anyone struggling to dress them—\nselves it's this:\n\nThere's a nigh probubility that your clothes are the wrong size.\n"}]}},"__N_SSG":true}